
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(СчетНаОплатуРасширенный)
	ТабДок = Новый ТабличныйДокумент;
	СчетНаОплатуРасширенный(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	//ТабДок.Показать();
	ТабДок.Показать("Счет на оплату покупателю");
	//}}
КонецПроцедуры

&НаСервере
Процедура СчетНаОплатуРасширенный(ТабДок, ПараметрКоманды)
	Документы.СчетНаОплату.СчетНаОплатуРасширенный(ТабДок, ПараметрКоманды);
КонецПроцедуры
