
Процедура УтверждениеЦен(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(УтверждениеЦен)
	Макет = Документы.РегистрацияЦен.ПолучитьМакет("УтверждениеЦен");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрацияЦен.Дата,
	|	РегистрацияЦен.Комментарий,
	|	РегистрацияЦен.Номер,
	|	РегистрацияЦен.Цены.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Цена
	|	)
	|ИЗ
	|	Документ.РегистрацияЦен КАК РегистрацияЦен
	|ГДЕ
	|	РегистрацияЦен.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЦеныШапка = Макет.ПолучитьОбласть("ЦеныШапка");
	ОбластьЦены = Макет.ПолучитьОбласть("Цены");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьЦеныШапка);
		ВыборкаЦены = Выборка.Цены.Выбрать();
		Пока ВыборкаЦены.Следующий() Цикл
			ОбластьЦены.Параметры.Заполнить(ВыборкаЦены);
			ТабДок.Вывести(ОбластьЦены, ВыборкаЦены.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
