
&НаКлиенте
Процедура Пятидневка(Команда)
	График = 5; 
	СформироватьГрафик(График);
КонецПроцедуры

&НаКлиенте
Процедура Шестидневка(Команда)
	График = 6; 
	СформироватьГрафик(График);
КонецПроцедуры


&НаКлиенте
Процедура СформироватьГрафик(График)
	перем Отказ;
	
	Вопросы.ЗадатьВопросПользователю(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.РабочийГрафик.Очистить();
	
	ДеньГрафика = НачалоГода(Объект.Дата);
	
	Пока ДеньГрафика <= КонецГода(Объект.Дата) Цикл
		
		НовЗн = Объект.РабочийГрафик.Добавить();
		НовЗн.День = ДеньГрафика;
		
		//Не оптимально
		//Если График = 5 Тогда
		//	Если ДеньНедели(ДеньГрафика) <= 5 Тогда
		//		НовЗн.Значение = 1;
		//	Иначе
		//		НовЗн.Значение = 0;
		//	КонецЕсли;
		//ИначеЕсли График = 6 Тогда
		//	Если ДеньНедели(ДеньГрафика) <= 6 Тогда
		//		НовЗн.Значение = 1;
		//	Иначе
		//		НовЗн.Значение = 0;
		//	КонецЕсли;
		//КонецЕсли;  
		
		//Оптимизированный вариант
		Если ДеньНедели(ДеньГрафика) <= График Тогда
			НовЗн.Значение = 1;
		Иначе
			НовЗн.Значение = 0;
		КонецЕсли;
			
		
		ДеньГрафика = ДеньГрафика + 60 * 60 * 24;
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры 














