
Процедура РассчитатьСумму(СтрокаТЧ) Экспорт
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
КонецПроцедуры


Функция ИтоговоеЧислоПрописью(СуммаИтого) Экспорт
	
	Если СуммаИтого > 0 Тогда
		ФормСтрока = "Л = ru_RU; ДП = Ложь";
		ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
		ПрописьЧисла = ЧислоПрописью(СуммаИтого, ФормСтрока, ПарПредмета);
		
		СуммаИтогоПрописью = "Итого: " + Формат(СуммаИтого,"ЧДЦ=2; ЧРД=,; ЧРГ=' '") + 
		" / " + ПрописьЧисла + ".";
	Иначе
		СуммаИтогоПрописью = "<< >>";
	КонецЕсли;
		
	Возврат СуммаИтогоПрописью;
		
КонецФункции


Процедура ОчиститьСтрокуТЧ(СтрокаТЧ) Экспорт
	СтрокаТЧ.Количество	= "";
	СтрокаТЧ.Цена = "";
	СтрокаТЧ.Сумма = "";
	СтрокаТЧ.ЕдиницаИзмерения = ""; 
	СтрокаТЧ.ВидНоменклатуры = "";
КонецПроцедуры