&НаКлиенте
Процедура ПересчетТЧ_Товары(Элемент)
	РаботаСДокументами.РассчитатьСумму(Элементы.ТабТовары.ТекущиеДанные);
КонецПроцедуры  

&НаКлиенте
Процедура ПересчетТЧ_Услуги(Элемент)
	РаботаСДокументами.РассчитатьСумму(Элементы.ТабУслуги.ТекущиеДанные);
КонецПроцедуры 


&НаКлиенте
Процедура ТабНоменклатураПриИзменении(Элемент)
	Объект.СуммаДокумента = 
	Объект.ТабТовары.Итог("Сумма") + Объект.ТабУслуги.Итог("Сумма");
	
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры 


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.Договор = АвтозаполнениеРеквизитов.УстановитьОсновнойДоговорКонтрагента(Объект.Контрагент);
	
	ОчиститьСообщения();
	АвтозаполнениеРеквизитов.ПроверкаКонтрагента(2, Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ТабТоварыНоменклатураПриИзменении(Элемент)
	
	РаботаСДокументами.ОчиститьСтрокуТЧ(Элементы.ТабТовары.ТекущиеДанные);
	
	СтрокаТЧ = Элементы.ТабТовары.ТекущиеДанные;
	СтрокаТЧ.Цена = РаботаСЦеной.ЦенаПродажи(Объект.Дата, СтрокаТЧ.Номенклатура);
	
	СтрокаТЧ = Элементы.ТабТовары.ТекущиеДанные;
	Тов = СтрокаТЧ.Номенклатура;
	СтрокаТЧ.ЕдиницаИзмерения = РаботаСоСправочниками.ПолучитьЕИ(Тов);
	СтрокаТЧ.ВидНоменклатуры = РаботаСоСправочниками.ПолучитьВидНоменклатуры(Тов);
	
	Объект.СуммаДокумента = Объект.ТабТовары.Итог("Сумма") + Объект.ТабУслуги.Итог("Сумма");
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);

КонецПроцедуры 


&НаКлиенте
Процедура ТабУслугиНоменклатураПриИзменении(Элемент)
	
	РаботаСДокументами.ОчиститьСтрокуТЧ(Элементы.ТабУслуги.ТекущиеДанные);
	
	СтрокаТЧ = Элементы.ТабУслуги.ТекущиеДанные;
	СтрокаТЧ.Цена = РаботаСЦеной.ЦенаПродажи(Объект.Дата, СтрокаТЧ.Номенклатура);
	
	СтрокаТЧ = Элементы.ТабУслуги.ТекущиеДанные;
	Тов = СтрокаТЧ.Номенклатура;
	СтрокаТЧ.ЕдиницаИзмерения = РаботаСоСправочниками.ПолучитьЕИ(Тов);
	СтрокаТЧ.ВидНоменклатуры = РаботаСоСправочниками.ПолучитьВидНоменклатуры(Тов);
	
	Объект.СуммаДокумента = Объект.ТабТовары.Итог("Сумма") + Объект.ТабУслуги.Итог("Сумма");
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);

КонецПроцедуры


&НаКлиенте
Процедура СвернутьТЧ(Команда)
	перем Отказ;
	
	Вопросы.ЗадатьВопросПользователю(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СвернутьТЧНаСервере();
КонецПроцедуры     

&НаСервере
Процедура СвернутьТЧНаСервере()
	
	ТЗ = Объект.ТабТовары.Выгрузить();		
	//Складываем дубли 
	//ТЗ.Свернуть("Номенклатура, Цена", "Количество, Сумма");
	//ТЗ.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры", "Количество, Сумма");
	
	ТЗ.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры, НаборСвойств", "Количество, Сумма");  
	
	Объект.ТабТовары.Загрузить(ТЗ);
	
	//---------------------------------------------
	
	ТЗ = Объект.ТабУслуги.Выгрузить();		
	//Складываем дубли 
	//ТЗ.Свернуть("Номенклатура, Цена", "Количество, Сумма");
	//ТЗ.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры", "Количество, Сумма");
	
	ТЗ.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры, НаборСвойств", "Количество, Сумма");  
	
	Объект.ТабУслуги.Загрузить(ТЗ);
		
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабТовары(Команда)
	
	перем Отказ;
	
	Вопросы.ЗадатьВопросПользователю(Отказ); 
			
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ТабТовары.Очистить();
	Объект.СуммаДокумента = Объект.ТабТовары.Итог("Сумма") + Объект.ТабУслуги.Итог("Сумма");
		
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОчиститьТабУслуги(Команда)
	
	перем Отказ;
	
	Вопросы.ЗадатьВопросПользователю(Отказ); 
			
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ТабУслуги.Очистить();
	Объект.СуммаДокумента = Объект.ТабТовары.Итог("Сумма") + Объект.ТабУслуги.Итог("Сумма");
		
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
	
КонецПроцедуры







