
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьЗаказаПоставщику)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьЗаказаПоставщику(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьЗаказаПоставщику(ТабДок, ПараметрКоманды)
	Документы.ЗаказТоваров.ПечатьЗаказаПоставщику(ТабДок, ПараметрКоманды);
КонецПроцедуры
