
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЗаработнаяПлата
	Движения.ЗаработнаяПлата.Записывать = Истина;
	
	// регистр ДолгиПоЗаработнойПлате Приход
	Движения.ДолгиПоЗаработнойПлате.Записывать = Истина;
	
	
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.ЗаработнаяПлата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад;
		Движение.ПериодДействияНачало = ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ДатаОкончания);
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = ДатаНачала;
		Движение.БазовыйПериодКонец = КонецДня(ДатаОкончания);
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		//Движение.Сумма = 1;
		Движение.РасчетныеДанные = ТекСтрокаНачисления.Начислено;
		Движение.ГрафикРаботы = ГрафикРаботы; 
		
		
		Движения.ЗаработнаяПлата.Записать();
		
		
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаработнаяПлатаДанныеГрафика.ЗначениеПериодДействия КАК Норма,
		|	ЗаработнаяПлатаДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
		|	ЗаработнаяПлатаДанныеГрафика.РасчетныеДанные КАК РасчетныеДанные
		|ИЗ
		|	РегистрРасчета.ЗаработнаяПлата.ДанныеГрафика(Регистратор = &Регистратор) КАК ЗаработнаяПлатаДанныеГрафика
		|ГДЕ
		|	ЗаработнаяПлатаДанныеГрафика.Сотрудник = &Сотрудник";
		
		Запрос.УстановитьПараметр("Сотрудник", ТекСтрокаНачисления.Сотрудник);
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий(); 
			
			Если ВыборкаДетальныеЗаписи.Норма <> 0 Тогда
				
				Оклад = ВыборкаДетальныеЗаписи.РасчетныеДанные * 
				ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.Норма;
				
				Движение.Сумма = Оклад;
				
				Движения.ЗаработнаяПлата.Записать();
				
				
				// регистр ДолгиПоЗаработнойПлате Приход
				Движение = Движения.ДолгиПоЗаработнойПлате.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник; 
				Движение.ВидНачисления = ПланыВидовРасчета.Начисления.Оклад;
				Движение.Сумма = Оклад;
				
			Иначе
				Сообщить("Не заполнен график работ!");			
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры
