
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЗаработнаяПлата
	Движения.ЗаработнаяПлата.Записывать = Истина;
	Движение = Движения.ЗаработнаяПлата.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = ПланыВидовРасчета.Начисления.ПремияФиксированная;
	Движение.ПериодДействияНачало = НачалоМесяца(Дата);
	Движение.ПериодДействияКонец = КонецМесяца(Дата);
	Движение.ПериодРегистрации = Дата;
	Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
	Движение.БазовыйПериодКонец = КонецМесяца(Дата);
	Движение.Сотрудник = Сотрудник;
	Движение.Сумма = Сумма;

	// регистр ДолгиПоЗаработнойПлате Приход
	Движения.ДолгиПоЗаработнойПлате.Записывать = Истина;
	Движение = Движения.ДолгиПоЗаработнойПлате.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.ВидНачисления = ПланыВидовРасчета.Начисления.ПремияФиксированная;
	Движение.Сумма = Сумма;

КонецПроцедуры
