

Функция УстановитьОсновнойДоговорКонтрагента(Контрагент) Экспорт
	Возврат Контрагент.ОсновнойДоговор;
КонецФункции

Процедура ПроверкаКонтрагента(ВидДокумента, Контрагент) Экспорт
	//1 - Документы поступления
	//2 - Документы продажи
	
	Если ВидДокумента = 1 Тогда
		Если НЕ Контрагент.ЭтоПоставщик Тогда
			Сообщить("Контрагент " + Контрагент + " не является поставщиком!");
		КонецЕсли;
	ИначеЕсли ВидДокумента = 2 Тогда
		Если НЕ Контрагент.ЭтоПокупатель Тогда
			Сообщить("Контрагент " + Контрагент + " не является покупателем!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры   


Функция ПроверкаКонтрагентаДляПроведенияДокументов(ВидДокумента, Контрагент) Экспорт
	//1 - Документы поступления
	//2 - Документы продажи
	
	ФлагРазрешенияПроведенияДокумента = Ложь;
	
	Если ВидДокумента = 1 Тогда
		Если НЕ Контрагент.ЭтоПоставщик Тогда
			Сообщить("Контрагент " + Контрагент + " не является поставщиком!");
			ФлагРазрешенияПроведенияДокумента = Истина;
		КонецЕсли;
	ИначеЕсли ВидДокумента = 2 Тогда
		Если НЕ Контрагент.ЭтоПокупатель Тогда
			Сообщить("Контрагент " + Контрагент + " не является покупателем!");
			ФлагРазрешенияПроведенияДокумента = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ФлагРазрешенияПроведенияДокумента;
	
КонецФункции