
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.Договор;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Мастер = ДанныеЗаполнения.Мастер;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Для Каждого ТекСтрокаТабНоменклатура Из ДанныеЗаполнения.ТабНоменклатура Цикл
			
			Если ТекСтрокаТабНоменклатура.Номенклатура.ВидНоменклатуры =  
				Перечисления.ВидыНоменклатуры.Услуга Тогда
				
				НоваяСтрока = ТабНоменклатура.Добавить();
				НоваяСтрока.Количество = ТекСтрокаТабНоменклатура.Количество;
				НоваяСтрока.Номенклатура = ТекСтрокаТабНоменклатура.Номенклатура;
				НоваяСтрока.Сумма = ТекСтрокаТабНоменклатура.Сумма;
				НоваяСтрока.Цена = ТекСтрокаТабНоменклатура.Цена;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Отказ = АвтозаполнениеРеквизитов.ПроверкаКонтрагентаДляПроведенияДокументов(2,Контрагент); 
	
	//Работа с дублями
	
	//Удаляем дубли
	//ТабНоменклатура.Свернуть("Номенклатура, Количество, Цена, Сумма");
	
	
	//Складываем дубли 
	//ТабНоменклатура.Свернуть("Номенклатура, Цена", "Количество, Сумма");
	//ТабНоменклатура.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры", "Количество, Сумма");
	ТабНоменклатура.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры, НаборСвойств", "Количество, Сумма");
	
	
	СуммаДокумента = ТабНоменклатура.Итог("Сумма");
	
	//--------------------------------------------------------------
	
	
	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	
	// регистр УчетУслуг
	Движения.УчетУслуг.Записывать = Истина; 
	
	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	
	// регистр Взаиморасчеты Приход
	Движения.Взаиморасчеты.Записывать = Истина;
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Контрагент;
	Движение.Договор = Договор;
	Движение.Сумма = СуммаДокумента;
	
	Для Каждого ТекСтрокаТабНоменклатура Из ТабНоменклатура Цикл
		// регистр Продажи
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТабНоменклатура.Номенклатура;
		Движение.Мастер = Мастер;
		Движение.Клиент = Контрагент;
		Движение.Количество = ТекСтрокаТабНоменклатура.Количество;
		Движение.Выручка = ТекСтрокаТабНоменклатура.Сумма;
		
		Если ТекСтрокаТабНоменклатура.Номенклатура.ВидНоменклатуры = 
		Перечисления.ВидыНоменклатуры.Услуга Тогда
			// регистр УчетУслуг
			Движение = Движения.УчетУслуг.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТабНоменклатура.Номенклатура;
			Движение.Мастер = Мастер;
			Движение.Клиент = Контрагент;
			Движение.Выручка = ТекСтрокаТабНоменклатура.Сумма; 
			
			
			// регистр Управленческий
			Движение = Движения.Управленческий.Добавить();
			Движение.СчетДт = ПланыСчетов.Основной.РасчетыСПокупателями;
			Движение.СчетКт = ПланыСчетов.Основной.Выручка;
			Движение.Период = Дата;
			Движение.Сумма = ТекСтрокаТабНоменклатура.Сумма;
			Движение.Количество = ТекСтрокаТабНоменклатура.Количество;
			Движение.СодержаниеОперации = "Реализация услуг";
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Договор;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры
