
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.Договор;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Мастер = ДанныеЗаполнения.Мастер;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Для Каждого ТекСтрокаТабНоменклатура Из ДанныеЗаполнения.ТабНоменклатура Цикл
			
			Если ТекСтрокаТабНоменклатура.Номенклатура.ВидНоменклатуры <> 
				Перечисления.ВидыНоменклатуры.Услуга Тогда
				
				НоваяСтрока = ТабНоменклатура.Добавить();
				НоваяСтрока.Количество = ТекСтрокаТабНоменклатура.Количество;
				НоваяСтрока.Номенклатура = ТекСтрокаТабНоменклатура.Номенклатура;
				НоваяСтрока.Сумма = ТекСтрокаТабНоменклатура.Сумма;
				НоваяСтрока.Цена = ТекСтрокаТабНоменклатура.Цена;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	
	Отказ = АвтозаполнениеРеквизитов.ПроверкаКонтрагентаДляПроведенияДокументов(2,Контрагент); 
	
	//Работа с дублями
	
	//Удаляем дубли
	//ТабНоменклатура.Свернуть("Номенклатура, Количество, Цена, Сумма");
	
	
	//Складываем дубли 
	//ТабНоменклатура.Свернуть("Номенклатура, Цена", "Количество, Сумма"); 
	//ТабНоменклатура.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры", "Количество, Сумма");
	ТабНоменклатура.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры, НаборСвойств", "Количество, Сумма");
	
	СуммаДокумента = ТабНоменклатура.Итог("Сумма");
	
	//--------------------------------------------------------------
	
	
	// регистр ОстаткиМатериалов Расход
	Движения.ОстаткиМатериалов.Записывать = Истина; 
	
	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	
	// регистр СтоимостьМатериалов Расход
	Движения.СтоимостьМатериалов.Записывать = Истина; 
	
	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	
	
	// регистр Взаиморасчеты Приход
	Движения.Взаиморасчеты.Записывать = Истина;
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Контрагент;
	Движение.Договор = Договор;
	Движение.Сумма = СуммаДокумента;
	
	
	
	Для Каждого ТекСтрокаТабНоменклатура Из ТабНоменклатура Цикл
		
		Если ТекСтрокаТабНоменклатура.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга Тогда
			// регистр ОстаткиМатериалов Расход
			Движение = Движения.ОстаткиМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Материал = ТекСтрокаТабНоменклатура.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = ТекСтрокаТабНоменклатура.Количество;
			//Добавили движение по характеристикам номенклатуры
			Движение.НаборСвойств = ТекСтрокаТабНоменклатура.НаборСвойств;

			
			//// регистр СтоимостьМатериалов Расход
			//Движение = Движения.СтоимостьМатериалов.Добавить();
			//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			//Движение.Период = Дата;
			//Движение.Материал = ТекСтрокаТабНоменклатура.Номенклатура;
			//Движение.Склад = Склад;
			////Движение.Стоимость = 1;
			//Движение.Количество = ТекСтрокаТабНоменклатура.Количество;
		КонецЕсли;
		
		//// регистр Продажи
		//Движение = Движения.Продажи.Добавить();
		//Движение.Период = Дата;
		//Движение.Номенклатура = ТекСтрокаТабНоменклатура.Номенклатура;
		//Движение.Мастер = Мастер;
		//Движение.Клиент = Контрагент;
		//Движение.Количество = ТекСтрокаТабНоменклатура.Количество;
		//Движение.Выручка = ТекСтрокаТабНоменклатура.Сумма;
		////Движение.Стоимость = 1;
		
	КонецЦикла;
	
	
	//*********** Контроль отрицательных остатков ***********
	
	Движения.ОстаткиМатериалов.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиМатериаловОстатки.Материал КАК Материал,
	|	ОстаткиМатериаловОстатки.Склад КАК Склад,
	|	ОстаткиМатериаловОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиМатериалов.Остатки(
	|			,
	|			Склад = &Склад
	|				И Материал В
	|					(ВЫБРАТЬ
	|						РеализацияТоваровТабНоменклатура.Номенклатура КАК Номенклатура
	|					ИЗ
	|						Документ.РеализацияТоваров.ТабНоменклатура КАК РеализацияТоваровТабНоменклатура
	|					ГДЕ
	|						РеализацияТоваровТабНоменклатура.Ссылка = &Ссылка)) КАК ОстаткиМатериаловОстатки
	|ГДЕ
	|	ОстаткиМатериаловОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	                                            
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Сообщить("На складе: " + ВыборкаДетальныеЗаписи.Склад + " не хватает номенклатуры: " +
			ВыборкаДетальныеЗаписи.Материал + " в количестве: " + ВыборкаДетальныеЗаписи.Количество);
			
		КонецЦикла; 
		
	Иначе
		
		//Отказ = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтоимостьМатериаловОстатки.Материал КАК Материал,
		|	СтоимостьМатериаловОстатки.Склад КАК Склад,
		|	СтоимостьМатериаловОстатки.СтоимостьОстаток КАК Стоимость,
		|	СтоимостьМатериаловОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.СтоимостьМатериалов.Остатки(
		|			&МоментВремени,
		|			Склад = &Склад
		|				И Материал В
		|					(ВЫБРАТЬ
		|						РеализацияТоваровТабНоменклатура.Номенклатура КАК Номенклатура
		|					ИЗ
		|						Документ.РеализацияТоваров.ТабНоменклатура КАК РеализацияТоваровТабНоменклатура
		|					ГДЕ
		|						РеализацияТоваровТабНоменклатура.Ссылка = &Ссылка)) КАК СтоимостьМатериаловОстатки";
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.Количество <> 0 Тогда
				//Получаем себестоимость 1 единицы номенклатуры
				СебестоимостьЕдиницы = ВыборкаДетальныеЗаписи.Стоимость / ВыборкаДетальныеЗаписи.Количество;
			Иначе
				СебестоимостьЕдиницы = 0;
				Сообщить("У номенклатуры: " + ВыборкаДетальныеЗаписи.Материал +
				" нет количества в регистре, но осталась сумма.
				|Скорее всего, нарушена последовательность документов.");
			КонецЕсли; 
			
			
			
			// регистр СтоимостьМатериалов Расход
			Движение = Движения.СтоимостьМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата; 
			Движение.Склад = Склад;
			
			//Найдем нужную Номенклатуру в табличной части документа
			//Движение.Материал = ВыборкаДетальныеЗаписи.Номенклатура;
			СтрТЧ = ТабНоменклатура.Найти(ВыборкаДетальныеЗаписи.Материал, "Номенклатура");
			Движение.Материал = СтрТЧ.Номенклатура;
			Движение.Количество = СтрТЧ.Количество;
			
			СебестоимостьСписания = СебестоимостьЕдиницы * СтрТЧ.Количество;
			
			//Движение.Стоимость = 1;
			Движение.Стоимость = СебестоимостьСписания;
			
			Движения.СтоимостьМатериалов.Записать(); 
			
			
			// регистр Продажи
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата; 
			Движение.Мастер = Мастер;
			Движение.Клиент = Контрагент;
			
			Движение.Номенклатура = СтрТЧ.Номенклатура;
			Движение.Количество = СтрТЧ.Количество;
			Движение.Выручка = СтрТЧ.Сумма;
			Движение.Стоимость = СебестоимостьСписания;
			
			Движения.Продажи.Записать();
			
			
			// регистр Управленческий
			
			//Проводка №1. Дт 62 - Кт 90.1 (Цена продажи) - Выручка
			Движение = Движения.Управленческий.Добавить();
			Движение.СчетДт = ПланыСчетов.Основной.РасчетыСПокупателями;
			Движение.СчетКт = ПланыСчетов.Основной.Выручка;
			Движение.Период = Дата;
			Движение.Сумма = СтрТЧ.Сумма;
			Движение.Количество = СтрТЧ.Количество;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Договор;
			Движение.СодержаниеОперации = "Выручка от реализации товаров покупателю";
			
			//Проводка №2. Дт 90.2 - Кт 41 (В сумме будет Себестоимость
			Движение = Движения.Управленческий.Добавить();
			Движение.СчетДт = ПланыСчетов.Основной.Себестоимость;
			Движение.СчетКт = ПланыСчетов.Основной.Товары;
			Движение.Период = Дата;
			Движение.Сумма = СебестоимостьСписания;
			Движение.Количество = СтрТЧ.Количество;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = СтрТЧ.Номенклатура;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
			Движение.СодержаниеОперации = "Списание себестоимости";
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры  








