
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ВыпискаБанка)
	ТабДок = Новый ТабличныйДокумент;
	ВыпискаБанка(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ВыпискаБанка(ТабДок, ПараметрКоманды)
	Документы.ВыпискаБанка.ВыпискаБанка(ТабДок, ПараметрКоманды);
КонецПроцедуры
