
Функция СформироватьСокращенноеФИОИзСтроки(СтрФИО) Экспорт
	//перем Фамилия, Имя, Отчесво;
	
	ПолучФИО = СтрРазделить(СтрФИО, " ");
	
	Если ПолучФИО.Количество() = 3 Тогда
		Фамилия = ТРег(ПолучФИО[0]);
		Имя = Лев(ТРег(ПолучФИО[1]),1);
		Отчество = Лев(ТРег(ПолучФИО[2]),1);  
		
		Зн = Фамилия + " " + Имя + "." + Отчество + ".";
	ИначеЕсли ПолучФИО.Количество() = 2 Тогда
		Фамилия = ТРег(ПолучФИО[0]);
		Имя = Лев(ТРег(ПолучФИО[1]),1); 
		
		Зн = Фамилия + " " + Имя + ".";
	ИначеЕсли ПолучФИО.Количество() = 1 Тогда 
		Фамилия = ТРег(ПолучФИО[0]);
		
		Зн = Фамилия;
	КонецЕсли;
	
	Возврат Зн;

	
КонецФункции


Функция ПолучитьЕИ(Тов) Экспорт
	Возврат Тов.ЕдИзм;
КонецФункции  


Функция ПолучитьВидНоменклатуры(Тов) Экспорт
	Возврат Тов.ВидНоменклатуры;        
КонецФункции

	                     
	