
&НаСервере
Процедура ВыплатитьЗПНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДолгиПоЗаработнойПлатеОстатки.Сотрудник КАК Сотрудник,
		|	ДолгиПоЗаработнойПлатеОстатки.СуммаОстаток КАК Задолженность
		|ИЗ
		|	РегистрНакопления.ДолгиПоЗаработнойПлате.Остатки КАК ДолгиПоЗаработнойПлатеОстатки
		|ГДЕ
		|	ДолгиПоЗаработнойПлатеОстатки.СуммаОстаток > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Объект.Сотрудники.Добавить();
		НовСтр.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		
		Если Объект.Аванс Тогда                                 
			НовСтр.Сумма = Константы.Аванс.Получить();
		Иначе
			НовСтр.Сумма = ВыборкаДетальныеЗаписи.Задолженность; 
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыплатитьЗП(Команда)
	Объект.Сотрудники.Очистить();
	ВыплатитьЗПНаСервере();
КонецПроцедуры
