
&НаКлиенте
Процедура РазделитьФИО(Команда)
	
	Объект.Фамилия = "";
	Объект.Имя = "";
	Объект.Отчество = "";
	
	ПолучФИО = СтрРазделить(Объект.Наименование, " ");
	
	Если ПолучФИО.Количество() = 3 Тогда
		Объект.Фамилия = ТРег(ПолучФИО[0]);
		Объект.Имя = ТРег(ПолучФИО[1]);
		Объект.Отчество = ТРег(ПолучФИО[2]);
	ИначеЕсли ПолучФИО.Количество() = 2 Тогда
		Объект.Фамилия = ТРег(ПолучФИО[0]);
		Объект.Имя = ТРег(ПолучФИО[1]);
	ИначеЕсли ПолучФИО.Количество() = 1 Тогда 
		Объект.Фамилия = ТРег(ПолучФИО[0]);
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьКраткоеФИО(Команда)
	ОчиститьСообщения();
	Сообщить(РаботаСоСправочниками.СформироватьСокращенноеФИОИзСтроки(Объект.Наименование));
КонецПроцедуры
