
Процедура ПечатьНакладной(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьНакладной)
	Макет = Документы.РеализацияТоваровИУслуг.ПолучитьМакет("ПечатьНакладной");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслуг.Дата,
	|	РеализацияТоваровИУслуг.Договор,
	|	РеализацияТоваровИУслуг.Комментарий,
	|	РеализацияТоваровИУслуг.Контрагент,
	|	РеализацияТоваровИУслуг.Мастер,
	|	РеализацияТоваровИУслуг.Номер,
	|	РеализацияТоваровИУслуг.Склад,
	|	РеализацияТоваровИУслуг.СуммаДокумента,
	|	РеализацияТоваровИУслуг.ТабТовары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		Цена,
	|		Сумма
	|	),
	|	РеализацияТоваровИУслуг.ТабУслуги.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	РеализацияТоваровИУслуг.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТабТоварыШапка = Макет.ПолучитьОбласть("ТабТоварыШапка");
	ОбластьТабТовары = Макет.ПолучитьОбласть("ТабТовары");
	ОбластьТабУслугиШапка = Макет.ПолучитьОбласть("ТабУслугиШапка");
	ОбластьТабУслуги = Макет.ПолучитьОбласть("ТабУслуги");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТабТоварыШапка);
		ВыборкаТабТовары = Выборка.ТабТовары.Выбрать();
		Пока ВыборкаТабТовары.Следующий() Цикл
			ОбластьТабТовары.Параметры.Заполнить(ВыборкаТабТовары);
			ТабДок.Вывести(ОбластьТабТовары, ВыборкаТабТовары.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьТабУслугиШапка);
		ВыборкаТабУслуги = Выборка.ТабУслуги.Выбрать();
		Пока ВыборкаТабУслуги.Следующий() Цикл
			ОбластьТабУслуги.Параметры.Заполнить(ВыборкаТабУслуги);
			ТабДок.Вывести(ОбластьТабУслуги, ВыборкаТабУслуги.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
