&НаКлиенте
Процедура ПересчетТЧ(Элемент)
	РаботаСДокументами.РассчитатьСумму(Элементы.ТабНоменклатура.ТекущиеДанные);
КонецПроцедуры

// -------------------------------------------------

&НаКлиенте
Процедура ТабНоменклатураПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ТабНоменклатура.Итог("Сумма");
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.Договор = АвтозаполнениеРеквизитов.УстановитьОсновнойДоговорКонтрагента(Объект.Контрагент);
	
	ОчиститьСообщения();
	АвтозаполнениеРеквизитов.ПроверкаКонтрагента(1, Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ТабНоменклатураНоменклатураПриИзменении(Элемент)
	РаботаСДокументами.ОчиститьСтрокуТЧ(Элементы.ТабНоменклатура.ТекущиеДанные);
	
	СтрокаТЧ = Элементы.ТабНоменклатура.ТекущиеДанные;
	Тов = СтрокаТЧ.Номенклатура;
	СтрокаТЧ.ЕдиницаИзмерения = РаботаСоСправочниками.ПолучитьЕИ(Тов);
	СтрокаТЧ.ВидНоменклатуры = РаботаСоСправочниками.ПолучитьВидНоменклатуры(Тов);
	
	Объект.СуммаДокумента = Объект.ТабНоменклатура.Итог("Сумма");
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТЧ(Команда)
	
	перем Отказ;
	
	Вопросы.ЗадатьВопросПользователю(Отказ); 
	
	//Если НЕ Отказ Тогда
	//	Объект.ТабНоменклатура.Очистить();
	//	Объект.СуммаДокумента = Объект.ТабНоменклатура.Итог("Сумма"); 
	//	
	//	//Можно написать и так:
	//	//Объект.СуммаДокумента = 0;
	//	
	//	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
	//КонецЕсли;
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ТабНоменклатура.Очистить();
	Объект.СуммаДокумента = Объект.ТабНоменклатура.Итог("Сумма"); 
	
	//Можно написать и так:
	//Объект.СуммаДокумента = 0;
	
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
		
КонецПроцедуры

&НаКлиенте
Процедура СвернутьТЧ(Команда)
	перем Отказ;
	
	Вопросы.ЗадатьВопросПользователю(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СвернутьТЧНаСервере(); 
	
КонецПроцедуры


&НаСервере
Процедура СвернутьТЧНаСервере()
	ТЗ = Объект.ТабНоменклатура.Выгрузить();
	//Сообщить(ТипЗнч(ТЗ)); 
	
	//Удаляем дубли
	//ТЗ.Свернуть("Номенклатура, Количество, Цена, Сумма");
	//Объект.СуммаДокумента = Объект.ТабНоменклатура.Итог("Сумма");
		
	//Складываем дубли 
	//ТЗ.Свернуть("Номенклатура, Цена", "Количество, Сумма");
	//ТЗ.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры", "Количество, Сумма");
	
	ТЗ.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры, НаборСвойств", "Количество, Сумма");  
	
	
	Объект.ТабНоменклатура.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.ТабНоменклатура.Итог("Сумма"); 	
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры










