
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьНакладной)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьНакладной(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьНакладной(ТабДок, ПараметрКоманды)
	Документы.РеализацияТоваровИУслуг.ПечатьНакладной(ТабДок, ПараметрКоманды);
КонецПроцедуры
