

Функция ЦенаПродажи(ДатаДок, Номенклатура) Экспорт 
	
	//Вариант 1.Получение периодического значения Цены, через отбор в регистре
	//Отбор = Новый Структура("Номенклатура");
	//Отбор.Вставить("Номенклатура", Номенклатура);
	//
	////Получаем актуальную Цену на определенный день по указанной номенклатуре
	//ЗначРесурса = РегистрыСведений.Цены.ПолучитьПоследнее(ДатаДок, Отбор);
	//
	//Возврат ЗначРесурса.Цена;     
	
	
	
	//Вариант 2. Получение периодического значения Цены, через Запрос
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	Возврат ВыборкаДетальныеЗаписи.Цена;
 
	
КонецФункции