
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(УтверждениеЦен)
	ТабДок = Новый ТабличныйДокумент;
	УтверждениеЦен(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура УтверждениеЦен(ТабДок, ПараметрКоманды)
	Документы.РегистрацияЦен.УтверждениеЦен(ТабДок, ПараметрКоманды);
КонецПроцедуры
