
&НаСервере
Процедура НайтиПоКодуНаСервере()
	ДлинаПередаваемойСтроки = СтрДлина(Объект.ПоискПоКоду);
	ДлинаКодаСправочника = Метаданные.Справочники.Номенклатура.ДлинаКода;
	КоличествоЛидирующихНулей = ДлинаКодаСправочника - ДлинаПередаваемойСтроки;
	
	ЛидирующиеНули = "";
	
	Для ПолучЗн = 1 По КоличествоЛидирующихНулей Цикл
		ЛидирующиеНули = ЛидирующиеНули + "0";
	КонецЦикла;
	
	Объект.ПоискПоКоду = ЛидирующиеНули + Объект.ПоискПоКоду;
	
	Спр = Справочники.Номенклатура;
	
	НайденнаяСсылка = Спр.НайтиПоКоду(Объект.ПоискПоКоду);
	
	Если НайденнаяСсылка = Спр.ПустаяСсылка() Тогда
		Сообщить("Элемента с кодом: " + Объект.ПоискПоКоду + " еще нет в базе.");
	Иначе
		Если НайденнаяСсылка.ЭтоГруппа Тогда
			Сообщить("Найденная ссылка является группой!");
			Возврат;
		КонецЕсли;
		
		Сообщить("Найден элемент с кодом: " + Объект.ПоискПоКоду + 
		" - его наименование: " + НайденнаяСсылка.Наименование);
		
		Объект.РезультатПоиска = НайденнаяСсылка.Ссылка;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоКоду(Команда)
	ОчиститьСообщения();
	Объект.РезультатПоиска = "";
	НайтиПоКодуНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиПоНаименованиюНаСервере()
	
	Спр = Справочники.Номенклатура;
	НайденнаяСсылка = Спр.НайтиПоНаименованию(Объект.ПоискПоНаименованию, Объект.ТочноеСоответствие);
	
	Если НайденнаяСсылка = Спр.ПустаяСсылка() Тогда
		Сообщить("Элемента с наименованием: " + Объект.ПоискПоНаименованию + " - еще нет в базе!");
		
		Если Объект.ТочноеСоответствие Тогда
			Сообщить("-----------------------");
			
			НовЭл = Спр.СоздатьЭлемент();
			НовЭл.Наименование = Объект.ПоискПоНаименованию;
			НовЭл.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
			
			
			СпрЕдИзм = Справочники.ЕдиницыИзмерения;
			НайденнаяЕИ = СпрЕдИзм.НайтиПоНаименованию("Шт",Истина);
			
			НовЭл.ЕдИзм = НайденнаяЕИ;
			
			НовЭл.Записать();
			
			Сообщить("Создан новый элемент: " + НовЭл.Наименование);
			
			Объект.РезультатПоиска = НовЭл.Ссылка;
			
		КонецЕсли;
	Иначе
		Если НайденнаяСсылка.ЭтоГруппа Тогда
			Сообщить("Найденная ссылка является группой");
			Возврат;
		КонецЕсли;
		
		Сообщить("Найденный элемент с наименованием: " + НайденнаяСсылка.Наименование +
		" - имеет значение кода: "  + НайденнаяСсылка.Код);
		
		Объект.РезультатПоиска = НайденнаяСсылка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоНаименованию(Команда)
	ОчиститьСообщения();
	Объект.РезультатПоиска = "";
	НайтиПоНаименованиюНаСервере();
КонецПроцедуры
