
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ГрафикиРаботы
	Движения.ГрафикиРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаРабочийГрафик Из РабочийГрафик Цикл
		Движение = Движения.ГрафикиРаботы.Добавить();
		Движение.ГрафикРаботы = График;
		Движение.Дата = ТекСтрокаРабочийГрафик.День;
		Движение.Значение = ТекСтрокаРабочийГрафик.Значение;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
